{
  "heading" : {
    "en" : "Publications",
    "de" : "Publikationen",
    "short": {
      "en": "Publications",
      "de": "Publikationen"
    }
  },
  
  "abstract" : {
    "en" : "Abstract",
    "de" : "Zusammenfassung" },

  "publications" : [
    { "key"       : "2014-thesis-evocells",
      "bibtex"    : "s2014-thesis.bib",
      "title"     : "Interaktive Visualisierung von hierarchischen, multivariaten und zeitlich variierenden Daten",
      "date"      : "2014-07-24",
      "authors"   : [ "Willy Scheibel" ],
      "published" : "Master's Thesis at the Hasso Plattner Institute, University of Potsdam",
      "articletype" : "Thesis",
      
      "caption": {
        "de": "Eine Treemap kodiert Hierarchien durch rekursive Unterteilung von zweidimensionalen Flächen und ermöglicht die Darstellung mehrerer Attribute z.B. mit der Größe der Grundfläche, der extrudierten Höhe und der Knotenfarbe. Bisherige Treemap-Layoutalgorithmen und -Darstellungstechniken sind nur bedingt zum Vergleich zweier Zustände zu verschiedenen Zeitpunkten geeignet, da (1) keinne Vergleichbarkeit der Treemap-Knoten innerhalb einer Treemap und über verschiedene Zustände hinweg ist gegeben ist und (2) Darstellungstechniken für den Größenunterschied eines Knotens über die Zeit fehlen. Diese Arbeit stellt die Techniken EvoCell-Layouting, Change Map und Change Hints vor. EvoCell-Layouting ist ein neuer Treemap-Algorithmus, welcher ein vorhandenes Treemap-Layout iterativ verändert. Change Maps sind Dichtekarten zum verorten von Änderungen in der Treemap, unabhängig von der Änderungs- und der Knotengröße. Change Hints stellen die Änderungen in den räumlichen Dimensionen zwischen zwei Zuständen auf den Knoten der Treemap dar. Diese drei Techniken verbessern das Verständnis von Entwicklungen in temporalen, hierarchischen Daten. Neben einer prototypischen Implementierung und einer Diskussion über Alternativen, wird durch Performanz- und Speicherverbrauchsanalysen gezeigt, dass die Techniken auf Echtdaten anwendbar sind. Eine abschließende Fallstudie beleuchtet die Entwicklung eines Open-Source Projektes und zeigt markante Punkte in der Entwicklung, die durch vorhandene Hierarchievisualisierungen nur schwer ersichtlich sind.",
        "en": "A treemap recursively subdivides a two-dimensional area in order to encode a hierarchy and enables the visualization of multiple attributes e.g. with the size, the extruded height or the color of a node. Traditional treemap layout algorithms and rendering techniques can only be used for the comparison of two data sets at different points in time to some extent, as (1) no comparison between nodes in a treemap and between different states is possible and (2) there are no rendering techniques for the size differences of a node over time. This thesis introduces the techniques EvoCell-Layouting, Change Map, and Change Hints. EvoCell-Layouting is a novel treemap layout algorithm that iteratively changes a given treemap layout. Change Maps are density maps to locate changes in attribute values disregarding the difference and the size of the node. Change Hints visualize spatial changes between two states of a treemap. These three techniques enhance the comprehension of the evolution of temporal hierarchical data. A prototypical implementation, a discussion about alternatives, and performance and memory analyses demonstrate real data applicability. An additional case study reveals distinctive changes in the software system of a monitored open-source project that are hard to detect with traditional hierarchy visualizations."
      },
      
      "thumbnail" : "publications/2014-thesis-evocells.png",
      "publication": "https://www.researchgate.net/profile/Willy_Scheibel/publication/331399809",
      "downloads" : [
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/331399809/inline/jsViewer/5c77be7692851c695046e78a?pdfJsDownload=1",
          "desc"  : "Document"
        } ],
      "doi": "10.13140/RG.2.2.33837.33763"
    },
    
    
    { "key"       : "2016-small-multiples",
      "bibtex"    : "std2016-small-multiples.bib",
      "title"     : "Interactive Revision Exploration using Small Multiples of Software Maps",
      "date"      : "2016-02-28",
      "authors"   : [ "Willy Scheibel", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "7th International Conference on Information Visualization Theory and Applications (IVAPP '16)",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "To explore and to compare different revisions of complex software systems is a challenging task as it requires to constantly switch between different revisions and the corresponding information visualization. This paper proposes to combine the concept of small multiples and focus+context techniques for software maps to facilitate the comparison of multiple software map themes and revisions simultaneously on a single screen. This approach reduces the amount of switches and helps to preserve the mental map of the user. Given a software project the small multiples are based on a common dataset but are specialized by specific revisions and themes. The small multiples are arranged in a matrix where rows and columns represents different themes and revisions, respectively. To ensure scalability of the visualization technique we also discuss two rendering pipelines to ensure interactive frame-rates. The capabilities of the proposed visualization technique are demonstrated in a collaborative exploration setting using a high-resolution, multi-touch display.",
        "de" : "Die Exploration und der Vergleich verschiedener Revisionen eines komplexen Softwaresystems ist eine komplizierte Aufgabe, da es einen ständigen Wechsel zwischen den Revisionen und den Visualisierungen erfordert. Diese Ausarbeitung stellt eine Kombination von Small Multiples, Focus+Context Techniken und Software Maps vor, die den Vergleich zwischen mehreren Software Map Themen und Revisionen gleichzeitig auf einem Bildschirm ermöglicht. Dieser Ansatz reduziert die Anzahl der benötigten Kontextwechsel für den Nutzer und ermöglicht die Erstellung einer mentalen Karte. Dabei werden die Small Multiples zu einem Softwaresystem über einen gemeinsamen Datensatz erstellt und in einer Matrix angeordnet, in der Zeilen und Spalten für die unterschiedlichen Themen und Revisionen stehen. Eine interaktive, skalierbare Visualierung ist über die Nutzung einer der zwei vorgestellten Renderingabläufe möglich. Weiterhin wir die Technik im Rahmen eines High-Resolution, Multi-Touch Display gezeigt und besprochen." },

      "thumbnail" : "publications/2016-ivapp-small-multiples.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0005694401310138",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Matthias_Trapp/publication/285164085/inline/jsViewer/56fbb61e08ae1b40b8062a54?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/331399816/inline/jsViewer/5c77ba33458515831f75e23b?pdfJsDownload=1",
          "desc"  : "Poster (Portrait)"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/331399594/inline/jsViewer/5c77b9d0458515831f75e227?pdfJsDownload=1",
          "desc"  : "Poster (Landscape)"
        } ],
      "doi": "10.5220/0005694401310138"
    },
    
    
    { "key"       : "2016-decl3d-treemaps",
      "bibtex"    : "lsld2016-decl3d-treemaps.bib",
      "title"     : "Dynamic 2.5D Treemaps using Declarative 3D on the Web",
      "date"      : "2016-07-23",
      "authors"   : [ "Daniel Limberger", "Willy Scheibel", "Stefan Lemme", "Jürgen Döllner" ],
      "published" : "21st International Conference on Web3D Technology (Web3D '16)",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "The 2.5D treemap represents a general purpose visualization technique to map multi-variate hierarchical data in a scalable, interactive, and consistent way used in a number of application fields. In this paper, we explore the capabilities of Declarative 3D for the web-based implementation of 2.5D treemap clients. Particularly, we investigate how X3DOM and XML3D can be used to implement clients with equivalent features that interactively display 2.5D treemaps with dynamic mapping of attributes. We also show a first step towards a glTF-based implementation. These approaches are benchmarked focusing on their interaction capabilities with respect to rendering and speed of dynamic data mapping. We discuss the results for our representative example of a complex 3D interactive visualization technique and summerize recommendations for improvements towards operational web clients.",
        "de" : "Die 2.5D Treemap stellt eine grundlegende, skalierbare und interaktive Visualisierungstechnik für multi-variate hierarchische Daten dar. In dieser Ausarbeitung durchleuchten wir die Möglichkeiten von deklarativem 3D für webbasierte 2.5D Treemap Clients. Besonderes Augenmerk legen wir auf X3DOM und XML3D, indem wir Clients mit gleichem Featureumfang (u.a. dynamische Attributmappings) für interaktive 2.5D Treemaps vergleichen. Weiterhin zeigen wir erste Ansätze für die Nutzung von glTF. Alle Ansätze wurden bezüglich ihrer Prozessierungs- und Renderinggeschwindigkeit. Wir diskutieren die Ergebnisse für unser representatives Beispiel einer komplexen 3D Visualisierungstechnik und fassen Verbesserungsvorschläge für produktive Web-Clients zusammen." },

      "thumbnail" : "publications/2016-web3d-decl3d-treemaps.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/2945292.2945313",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/305420771/inline/jsViewer/5b2cb47b4585150d23c1f3ea?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Daniel_Limberger/publication/331407662/inline/jsViewer/5c77e4fa299bf1268d2c7e74?pdfJsDownload=1",
          "desc"  : "Slides"
        },
        { "href"  : "https://github.com/cgcostume/web3d-treemaps",
          "desc"  : "Github Project"
        },
        { "href"  : "http://cgcostume.github.io/web3d-treemaps/",
          "desc"  : "Demo"
        } ],
      "doi": "10.1145/2945292.2945313"
    },
    
    
    { "key"       : "2017-importance-based-aggregation",
      "bibtex"    : "lshd2017-importance-based-aggregation.bib",
      "title"     : "Reducing Visual Complexity in Software Maps using Importance-based Aggregation of Nodes",
      "date"      : "2017-02-27",
      "authors"   : [ "Daniel Limberger", "Willy Scheibel", "Sebastian Hahn", "Jürgen Döllner" ],
      "published" : "8th International Conference on Information Visualization Theory and Applications (IVAPP)",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "Depicting massive software system data using software maps can result in visual clutter and increased cognitive load. This paper introduces an adaptive level-of-detail (LoD) technique that uses scoring for interactive aggregation on a per-node basis. The scoring approximates importance by degree-of-interest measures as well as screen and user-interaction scores. The technique adheres to established aggregation guidelines and was evaluated by means of two user studies. The first user study investigates task completion time in visual search. The second evaluates the readability of the presented nesting level contouring for aggregates. With the adap- tive LoD technique software maps allow for multi-resolution depictions of software system information. It facilitates efficient identification of important nodes and allows for additional annotation.",
        "de" : "Darstellungen massiver Softwaresystemdaten durch Softwarelagekarten können durch erhöhte kognitive Last und Visual Clutter beeinträchtigend für das Verständnis der Softwaresysteme sein. Diese Ausarbeitung stellt ein adaptives Level-of-Detail Verfahren vor, welches ein Bewertungssystem für interaktive Aggregation pro Knoten einsetzt. Das Bewertungssystem nähert die tatsächliche Relevanz über einen Revelanzgrad an, welcher über darstellungs- und nutzerbasierte Metriken ermittelt wird. Das Level-of-Detail Verfahren befolgt etablierte Aggregations-Richtlinien und wurde anhand von zwei Nutzerstudien evaluiert. Die erste Nutzerstudie untersucht die Bearbeitungszeiten von festgelegten Aufgaben. Die zweite wertet die Lestbarkeit der vorgestellen Nesting- Level-Konturen für Aggregate aus. Mit dem adaptiven Level-of-Detail Verfahren können Softwarelagekarten für Darstellungen von Softwareystemen auf unterschiedlichen Detailgraden eingesetzt werden. Es ermöglicht die effiziente Lokalisierung von wichtigen Knoten unter Bereitstellung von mehr Flächen für Beschriftung von Knoten." },

      "thumbnail" : "publications/2017-importance-based-aggregation.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0006267501760185",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Daniel_Limberger/publication/313377340/inline/jsViewer/589dbd3845851598bab4014b?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Daniel_Limberger/publication/331407406/inline/jsViewer/5c77deb8299bf1268d2c7c7b?pdfJsDownload=1",
          "desc"  : "Slides"
        } ],
      "doi": "10.5220/0006267501760185"
    },
    
    
    { "key"       : "2017-attributed-vertex-clouds",
      "bibtex"    : "sbtd2017-attributed-vertex-clouds.bib",
      "title"     : "Attributed Vertex Clouds",
      "date"      : "2017-05-15",
      "authors"   : [ "Willy Scheibel", "Stefan Buschmann", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "GPU Zen",
      "articletype" : "Chapter",
      
      "caption"   : {
        "en" : "In todays computer graphics applications, large 3D scenes are rendered which consist of polygonal geometries such as triangle meshes. Using state-of-the-art techniques, this geometry is often represented on the GPU using vertex and index buffers, as well as additional auxiliary data such as textures or uniform buffers. For polygonal meshes of arbitrary complexity, the described approach is indispensable. However, there are several types of simpler geometries (e.g., cuboids, spheres, tubes, or splats) that can be generated procedurally. We present an efficient data representation and rendering concept for such geometries, denoted as attributed vertex clouds (AVCs). Using this approach, geometry is generated on the GPU during execution of the programmable rendering pipeline. Each vertex is used as the argument for a function that procedurally generates the target geometry. This function is called a transfer function, and it is implemented using shader programs and therefore executed as part of the rendering process. This approach allows for compact geometry representation and results in reduced memory footprints in comparison to traditional representations. By shifting geometry generation to the GPU, the resulting volatile geometry can be controlled flexibly, i.e., its position, parameterization, and even the type of geometry can be modified without requiring state changes or uploading new data to the GPU. Performance measurements suggests improved rendering times and reduced memory transmission through the rendering pipeline.",
        "de" : "In heutigen computergrafischen Anwendungen werde zumeist große 3D Szenen gerendert, die aus polygonalen Geometrien wie Dreiecksnetze bestehen. Mit State-of-the-Art Techniken wird diese Geometrie auf der GPU mittels Vertex- und Indexbuffern enkodiert. For Polygonnetze beliebiger Komplexität ist dieser Ansatz unumgänglich. Allerdings gibt es Geometrietypen einfacherer Struktur (z. B. Würfel, Kugeln, Röhren oder Flächen) welche prozedural generiert werden können. Wir präsentieren eine effiziente Datenrepräsentation und Renderingkonzept für solche Geometrien, Attributed Vertex Cloud (AVC) genannt. Mit diesem Ansatz wird die Geometrie während der Ausführung der Renderingpipeline auf der Grafikkarte berechnet. Jeder Vertex der Geometrie wird als Argument an eine Funktion übergeben, welche die Zielgeometrie erzeugt. Diese Funktion nennen wir Transfer-Funktion und sie ist in Shader-Programmen implementiert und wird somit als Teil des Rendering-Prozesses ausgeführt. Der Ansatz ermöglicht kompakte Speicherrepräsentation der Geometrie gegenüber existierenden Verfahren. Die Verschiebung der Geometrieerzeugung auf die GPU ermöglicht auch die Umsetzung von flüchtiger Geometrie, welche dynamisch konfigurierbar ist (z. B. Position oder Parameter, sogar der Typ ist änderbar). Messungen der Ausführungszeiten deuten auf eine Verschnellerung der Framezeiten und eine geringere Speicher-Fußabdruck bei Datenübertragungen zwischen den Shader-Stages der Renderingpipeline." },

      "thumbnail" : "publications/2017-gpuzen-attributed-vertex-clouds.png",
      "downloads" : [
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/313554437/inline/jsViewer/5c4afbe2299bf12be3e1f44a?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://github.com/hpicgs/attributedvertexclouds",
          "desc"  : "Github Project"
        } ]
    },
    
    
    { "key"       : "2017-mixed-projection-treemaps",
      "bibtex"    : "lstd2017-mixed-projection-treemaps.bib",
      "title"     : "Mixed-Projection Treemaps: A Novel Approach Mixing 2D and 2.5D Treemaps",
      "date"      : "2017-07-11",
      "authors"   : [ "Daniel Limberger", "Willy Scheibel", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "21st International Conference on Information Visualisation (iV '17)",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "2D treemaps are a space-filling visualization technique that facilitate exploration of non-spatial, attributed, tree-structured data using the visual variables size and color. In extension thereto, 2.5D treemaps introduce height for additional information display. This extension entails challenges such as increased rendering effort, occlusion, or the need for navigation techniques that counterbalance the advantages of 2D treemaps to a certain degree. This paper presents a novel technique for combining 2D and 2.5D treemaps using multi-perspective views to leverage the advantages of both treemap types. It enables a new form of overview+detail visualization for complex treemaps and contributes new concepts for real-time rendering of and interaction with mixed-projection treemaps. The technique operates by tilting up inner nodes using affine transformations and animated state transitions. The mixed use of orthogonal and perspective projections is discussed and application examples that facilitate exploration of multi-variate data and benefit from the reduced interaction overhead are demonstrated.",
        "de" : "2D Treemaps sind eine raumfüllende Visualisierungstechnik für die Exploration von abstrakten, attribuierten Daten mit Baumstruktur. Dabei werden die visuellen Variablen Größe und Farbe benutzt. Als Erweiterung führen die 2.5D Treemaps die Höhe für zusätzliche Informationsdarstellung ein. Diese Erweiterung kommt jedoch mit Herausforderungen wie der komplexeren Bildsynthese, Verdeckung oder angepassten Navigationstechniken einher, welche den Vorteile einer reinen 2D Treemap gegenüberstehen. Dieses Paper präsentiert eine neuartige Kombination von 2D und 2.5D Treemaps unter Nutzung von multiperspektiven Ansichten um die Vorteile beider Techniken zu vereinen. Es ermöglicht eine Form der Overview+Detail Visualisierung für komplexe Treemaps, welche über neue Konzepte im Echtzeitrendering und Interaktion als Mixed-Projection Treemaps dargestellt werden können. Die Visualisierungstechnik nutzt eine Drehung innerer Treemap-Knoten über affine Transformationen und animierte Übergänge. Dabei werden die gemeinsame Nutzung von orthogonaler und perspektivischer Projektion besprochen und Anwendungsbeispiele für die Exploration multivariater Daten gezeigt, die von dem geringeren Interaktions-Overhead profitieren." },

      "thumbnail" : "publications/2017-iv-mixed-projection-treemaps.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1109/iV.2017.67",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Daniel_Limberger/publication/316999964/inline/jsViewer/5ab28be2aca272171001b92a?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Daniel_Limberger/publication/330106367/inline/jsViewer/5c77be80458515831f75e32b?pdfJsDownload=1",
          "desc"  : "Slides"
        } ],
      "doi": "10.1109/iV.2017.67"
    },
    
    
    { "key"       : "2018-evocells",
      "bibtex"    : "swd2018-evocells.bib",
      "title"     : "EvoCells – A Treemap Layout Algorithm for Evolving Tree Data",
      "date"      : "2018-01-29",
      "authors"   : [ "Willy Scheibel", "Christopher Weyand", "Jürgen Döllner" ],
      "published" : "9th International Conference on Information Visualization Theory and Applications (IVAPP '17)",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "We propose the rectangular treemap layout algorithm EvoCells that maps changes in tree-structured data onto an initial treemap layout. Changes in topology and node weights are mapped to insertion, removal, growth, and shrinkage of the layout rectangles. Thereby, rectangles displace their neighbors and stretche their enclosing rectangles with a run-time complexity of O(n log n). An evaluation using layout stability metrics on the open source ElasticSearch software system suggests EvoCells as a valid alternative for stable treemap layouting.",
        "de" : "Wir stellen den rechteckigen Treemap Layout Algorithmus EvoCells vor, welcher Änderungen in baumstrukturierten Daten auf ein initiales Treemap Layout anwendet. Änderungen in der Topologie und der Knotengewichte werden auf Einfügen, Löschen, Vergrößern und Verkleinern von Rechtecken im Layout übertragen. Dabei verdrängen Rechtecke ihre Nachbarn und vergrößern ihre umschließenden Rechtecke mit einer Laufzeitkomplexität von O(n log n). Eine Evaluierung mit Layoutstabilitätsmetriken aus dem Open Source Softwaresystem ElasticSearch deutet an, dass EvoCells eine valide Alternative zum stabilen Treemap Layouting ist." },

      "thumbnail" : "publications/2018-ivapp-evocells.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0006617102730280",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/321059325/inline/jsViewer/5b2cb4964585150d23c1f41f?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/331399914/inline/jsViewer/5c77bc00299bf1268d2b8178?pdfJsDownload=1",
          "desc"  : "Slides"
        }],
      "doi": "10.5220/0006617102730280"
    },
    
    
    { "key"       : "2019-hiviser",
      "bibtex"    : "shd2019-hiviser.bib",
      "title"     : "Design and Implementation of Web-Based Hierarchy Visualization Services",
      "date"      : "2019-02-28",
      "authors"   : [ "Willy Scheibel", "Judith Hartmann", "Jürgen Döllner" ],
      "published" : "10th International Conference on Information Visualization Theory and Applications (IVAPP '18)",
      "note"      : "Candidate for Best Paper",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "There is a rapidly growing, cross-domain demand for interactive, high-quality visualization techniques as components of web-based applications and systems. In this context, a key question is how visualization services can be designed, implemented, and operated based on Software-as-a-Service as software delivery model. In this paper, we present concepts and design of a SaaS framework and API of visualization techniques for tree-structured data, called HiViSer. Using representational state transfer (REST), the API supports different data formats, data manipulations, visualization techniques, and output formats. In particular, the API defines base resource types for all components required to create an image or a virtual scene of a hierarchy visualization. We provide a treemap visualization service as prototypical implementation for which subtypes of the proposed API resources have been created. The approach generally serves as a blue-print for fully web-based, high-end visualization services running on thin clients in a standard browser environment.",
        "de" : "" },

      "thumbnail" : "publications/2019-ivapp-hiviser.jpg",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0007693201410152",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/330541206/inline/jsViewer/5c77b545a6fdcc4715a1c47d?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/331399770/inline/jsViewer/5c77b8c692851c695046e654?pdfJsDownload=1",
          "desc"  : "Slides"
        },
        { "desc": "Homepage", "href": "https://hiviser.varg.dev" }
      ],
      "doi": "10.5220/0007693201410152"
    },
    
    
    { "key": "2019-software-map-metaphors-and-techniques",
      "bibtex": "lstd2019-software-map-metaphors-and-techniques.bib",
      "title": "Advanced Visual Metaphors and Techniques for Software Maps",
      "date": "2019-10-01",
      "authors": [ "Daniel Limberger", "Willy Scheibel", "Matthias Trapp", "Jürgen Döllner" ],
      "published": "12th International Symposium on Visual Information Communication and Interaction (VINCI '19)",
      "articletype" : "Full Paper",

      "caption": {
        "en" : "Software maps provide a general-purpose interactive user interface and information display for software analytics tools. This paper systematically introduces and classifies software maps as a treemap-based technique for software cartography. It provides an overview of advanced visual metaphors and techniques, each suitable for interactive visual analytics tasks, that can be used to enhance the expressiveness of software maps. Thereto, the metaphors and techniques are briefly described, located within a visualization pipeline model, and considered within the software map design space. Consequent applications and use cases w.r.t. different types of software system data and software engineering data are discussed, arguing for a versatile use of software maps in visual software analytics.",
        "de" : ""
      },
      "thumbnail" : "publications/2019-vinci-software-map-metaphors-and-techniques.jpg",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3356422.3356444",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Daniel_Limberger/publication/335062804/inline/jsViewer/5d883828a6fdcc8fd6106c95?pdfJsDownload=1",
          "desc"  : "Author Version"
        }
      ],
      "doi": "10.1145/3356422.3356444"
    },
    
    
    { "key": "2020-modular-hiviser",
      "bibtex": "shld2020-modular-hiviser.bib",
      "title": "Visualization of Tree-structured Data using Web Service Composition",
      "date": "2020-02-20",
      "authors": [ "Willy Scheibel", "Judith Hartmann", "Daniel Limberger", "Jürgen Döllner" ],
      "published": "VISIGRAPP 2019: Computer Vision, Imaging and Computer Graphics Theory and Applications",
      "articletype" : "Chapter",

      "caption": {
        "en" : "This article reiterates on the recently presented hierarchy visualization service HiViSer and its API. It illustrates its decomposition into modular services for data processing and visualization of tree-structured data. The decomposition is aligned to the common structure of visualization pipelines and, in this way, facilitates attribution of the services' capabilities. Suitable base resource types are proposed and their structure and relations as well as a subtyping concept for specifics in hierarchy visualization implementations are detailed. Moreover, state-of-the-art quality standards and techniques for self-documentation and discovery of components are incorporated. As a result, a blueprint for Web service design, architecture, modularization, and composition is presented, targeting fundamental visualization tasks of tree-structured data, i.e., gathering, processing, rendering, and provisioning. Finally, the applicability of the service components and the API is evaluated in the context of exemplary applications.",
        "de" : ""
      },
      "thumbnail" : "publications/2019-ivapp-hiviser-extended.jpg",
      "downloads" : [
        { "href"  : "https://doi.org/10.1007/978-3-030-41590-7_10",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/339362147/inline/jsViewer/5e5ccf0c4585152ce8ff8d73?pdfJsDownload=1",
          "desc"  : "Author Version"
        }
      ],
      "doi": "10.1007/978-3-030-41590-7_10"
    },
    
    
    { "key"       : "2020-treemap-taxonomy",
      "bibtex"    : "stld2020-treemap-taxonomy.bib",
      "title"     : "A Taxonomy of Treemap Visualization Techniques",
      "date"      : "2020-02-27",
      "authors"   : [ "Willy Scheibel", "Matthias Trapp", "Daniel Limberger", "Jürgen Döllner" ],
      "published" : "11th International Conference on Information Visualization Theory and Applications (IVAPP '20)",
      "articletype" : "Position Paper",
      
      "caption"   : {
        "en" : "A treemap is a visualization that has been specifically designed to facilitate the exploration of tree-structured data and, more general, hierarchically structured data. The family of visualization techniques that use a visual metaphor for parent-child relationships based “on the property of containment” (Johnson, 1993) is commonly referred to as treemaps. However, as the number of variations of treemaps grows, it becomes increasingly important to distinguish clearly between techniques and their specific characteristics. This paper proposes to discern between Space-filling Treemap, Containment Treemap, Implicit Edge Representation Tree, and Mapped Tree for classification of hierarchy visualization techniques and highlights their respective properties. This taxonomy is created as a hyponymy, i.e., its classes have an is-a relationship to one another. With this proposal, we intend to stimulate a discussion on a more unambiguous classification of treemaps and, furthermore, broaden what is understood by the concept of treemap itself.",
        "de" : "" },

      "thumbnail" : "publications/2020-ivapp-treemap-taxonomy.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0009153902730280",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/338402878/inline/jsViewer/5e5cd038a6fdccbeba12bf83?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/339617725/inline/jsViewer/5e5cd13ba6fdccbeba12bfea?pdfJsDownload=1",
          "desc"  : "Slides"
        }
      ],
      "doi": "10.5220/0009153902730280"
    },
    
    
    { "key"       : "2020-scatterplot",
      "bibtex"    : "wsltd2020-scatterplot.bib",
      "title"     : "A Framework for Interactive Exploration of Clusters in Massive Data using 3D Scatter Plots and WebGL",
      "date"      : "2020-12-01",
      "authors"   : [ "Lukas Wagner", "Willy Scheibel", "Daniel Limberger", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "25th International Conference on 3D Web Technology (Web3D '20)",
      "articletype" : "Extended Abstract",
      
      "caption"   : {
        "en" : "This paper presents a rendering framework for the visualization of massive point datasets in the web. It includes highly interactive point rendering, cluster visualization, basic interaction methods, and importance-based labeling, while being available for both mobile and desktop browsers. The rendering style is customizable, as shown in figure 1. Our evaluation indicates that the framework facilitates interactive visualization of tens of millions of raw data points even without dynamic filtering or aggregation.",
        "de" : "" },

      "thumbnail" : "publications/2020-web3d-scatterplot-renderer.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3424616.3424730",
          "desc"  : "Publisher Record"
        },
        { "href": "https://www.researchgate.net/profile/Lukas_Wagner18/publication/345770726/inline/jsViewer/5fbe75cb299bf104cf770132?pdfJsDownload=1",
          "desc": "Author Version"
        },
        { "href": "https://www.researchgate.net/profile/Lukas_Wagner18/publication/345770755/inline/jsViewer/5fad60e5299bf18c5b6aacb0?pdfJsDownload=1",
          "desc": "Slides"
        },
        { "href": "https://varg.dev/web3d2020/",
          "desc": "Demo"
        }
      ],
      "doi": "10.1145/3424616.3424730"
    },
    
    
    { "key"       : "2020-treemap-evaluation",
      "bibtex"    : "fsltd2020-treemap-evaluation.bib",
      "title"     : "Survey on User Studies on the Effectiveness of Treemaps",
      "date"      : "2020-12-02",
      "authors"   : [ "Carolin Fiedler", "Willy Scheibel", "Daniel Limberger", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "13th International Symposium on Visual Information Communication and Interaction (VINCI '20)",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "Treemaps are a commonly used tool for the visual display and communication of tree-structured, multi-variate data. In order to confidently know when and how treemaps can best be applied, the research community uses usability studies and controlled experiments to \"understand the potential and limitations of our tools\" (Plaisant, 2004). To support the communities' understanding and usage of treemaps, this survey provides a comprehensive review and detailed overview of 69 user studies related to treemaps. However, due to pitfalls and shortcomings in design, conduct, and reporting of the user studies, there is little that can be reliably derived or accepted as a generalized statement. Fundamental open questions include configuration, compatible tasks, use cases, and perceptional characteristics of treemaps. The reliability of findings and statements is discussed and common pitfalls of treemap user studies are identified.",
        "de" : "" },

      "thumbnail" : "publications/2020-vinci-treemap-evaluation.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3430036.3430054",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/346565359/inline/jsViewer/60083702a6fdccdcb8690e02?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://varg-dev.github.io/treemap-studies",
          "desc"  : "Companion Website"
        }
      ],
      "doi": "10.1145/3430036.3430054"
    },
    
    
    { "key"       : "2020-treemap-layouts",
      "bibtex"    : "sld2020-treemap-layouts.bib",
      "title"     : "Survey of Treemap Layout Algorithms",
      "date"      : "2020-12-03",
      "authors"   : [ "Willy Scheibel", "Daniel Limberger", "Jürgen Döllner" ],
      "published" : "13th International Symposium on Visual Information Communication and Interaction (VINCI '20)",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "This paper provides an overview of published treemap layout algorithms from 1991 to 2019 that were used for information visualization and computational geometry. First, a terminology is outlined for the precise communication of tree-structured data and layouting processes. Second, an overview and classification of layout algorithms is presented and application areas are discussed. Third, the use-case-specific adaption process is outlined and discussed. This overview targets practitioners and researchers by providing a starting point for own research, visualization design, and applications.",
        "de" : "" },

      "thumbnail" : "publications/2020-vinci-treemap-layouts.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3430036.3430041",
          "desc"  : "Publisher Record"
        },
	      { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/346565429/inline/jsViewer/6008e5e9a6fdccdcb86bb8d0?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
	      { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/348647547/inline/jsViewer/6008e45f299bf14088adae8b?pdfJsDownload=1",
          "desc"  : "Slides"
        }
      ],
      "doi": "10.1145/3430036.3430041"
    },
    
    
    { "key"       : "2021-software-forest",
      "bibtex"    : "achssld2021-software-forest.bib",
      "title"     : "Software Forest: A Visualization of Semantic Similarities in Source Code using a Tree Metaphor",
      "date"      : "2021-02-08",
      "authors"   : [ "Daniel Atzberger", "Tim Cech", "Merlin de la Haye", "Maximilian Söchting", "Willy Scheibel", "Daniel Limberger", "Jürgen Döllner" ],
      "published" : "12th International Conference on Information Visualization Theory and Applications (IVAPP '21)",
      "note"      : "Candidate for Best Student Paper",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "Software visualization techniques provide effective means for program comprehension tasks as they allow developers to interactively explore large code bases. A frequently encountered task during software development is the detection of source code files of similar semantic. To assist this task we present Software Forest, a novel 2.5D software visualization that enables interactive exploration of semantic similarities within a software system, illustrated as a forest. The underlying layout results from the analysis of the vocabulary of the software documents using Latent Dirichlet Allocation and Multidimensional Scaling and therefore reflects the semantic similarity between source code files. By mapping properties of a software entity, e.g., size metrics or trend data, to visual variables encoded by various, figurative tree meshes, aspects of a software system can be displayed. This concept is complemented with implementation details as well as a discussion on applications.",
        "de" : "" },

      "thumbnail" : "publications/2021-ivapp-software-forest.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0010267601120122",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/349382985/inline/jsViewer/6047926192851c077f2981ce?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/365824554/inline/jsViewer/63f5c80a0d98a97717ab5b9a?pdfJsDownload=1",
          "desc"  : "Slides"
        },
        { "href"  : "https://varg.dev/trees/",
          "desc"  : "Demo"
        }
      ],
      "doi": "10.5220/0010267601120122"
    },
    
    
    { "key"       : "2021-hilbert-moore-performance",
      "bibtex"    : "swbd2021-hilbertmooreperformance.bib",
      "title"     : "Algorithmic Improvements on Hilbert and Moore Treemaps for Visualization of Large Tree-structured Datasets",
      "date"      : "2021-06-14",
      "authors"   : [ "Willy Scheibel", "Christopher Weyand", "Joseph Bethge", "Jürgen Döllner" ],
      "published" : "23rd EG Conference on Visualization (EuroVis '21)",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "Hilbert and Moore treemaps are based on the same named space-filling curves to lay out tree-structured data for visualization. One main component of them is a partitioning subroutine, whose algorithmic complexity poses problems when scaling to industry-sized datasets. Further, the subroutine allows for different optimization criteria that result in different layout decisions. This paper proposes conceptual and algorithmic improvements to this partitioning subroutine. Two measures for the quality of partitioning are proposed, resulting in the min-max and min-variance optimization tasks. For both tasks, linear-time algorithms are presented that find an optimal solution. The implementation variants are evaluated with respect to layout metrics and run-time performance against a previously available greedy approach. The results show significantly improved run time and no deterioration in layout metrics, suggesting effective use of Hilbert and Moore treemaps for datasets with millions of nodes.",
        "de" : "" },

      "thumbnail" : "publications/2021-eurovis-hilbert-moore-treemaps.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.2312/evs.20211065",
          "desc"  : "Publisher Record"
        },
        { "href": "https://www.researchgate.net/profile/Willy-Scheibel/publication/351103336/inline/jsViewer/60a393a8a6fdccb8dc632568?pdfJsDownload=1",
          "desc": "Author Version"
        },
	      { "href"  : "https://www.researchgate.net/profile/Willy_Scheibel/publication/351659477/inline/jsViewer/60a3952c458515952dd44930?pdfJsDownload=1",
          "desc"  : "Slides"
        },
        { "href"  : "https://github.com/varg-dev/hilbert-moore-treemap-layouts-prototype",
          "desc"  : "Github Project"
        }
      ],
      "doi": "10.2312/evs.20211065"
    },
    
    
    { "key"       : "2021-procedural-textures",
      "bibtex"    : "lsdd2021-procedural-textures.bib",
      "title"     : "Visualization of Data Changes in 2.5D Treemaps using Procedural Textures and Animated Transitions",
      "date"      : "2021-09-06",
      "authors"   : [ "Daniel Limberger", "Willy Scheibel", "Jan van Dieken", "Jürgen Döllner" ],
      "published" : "14th International Symposium on Visual Information Communication and Interaction (VINCI '21)",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "This work investigates the extent to which animated procedural texture patterns can be used to support the representation of changes in 2.5D treemaps. Changes in height, color, and area of individual nodes can easily be visualized using animated transitions. Especially for changes in the color attribute, plain animated transitions are not able to directly communicate the direction of change itself. We show how procedural texture patterns can be superimposed to the color mapping and support transitions. To this end, we discuss qualitative properties of each pattern, demonstrate their ability to communicate change direction both with and without animation, and conclude which of the patterns are more likely to increase effectiveness and correctness of the change mapping in 2.5D treemaps.",
        "de" : "" },

      "thumbnail" : "publications/2021-vinci-procedural-textures.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3481549.3481570",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/354331984/inline/jsViewer/61486d013c6cb310697e65f0&pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/368690808/inline/jsViewer/63f5d26db1704f343f72e931?pdfJsDownload=1",
          "desc"  : "Slides"
        } ],
      "doi": "10.1145/3481549.3481570"
    },
    
    
    { "key"       : "2021-etf-visualization",
      "bibtex"    : "blsd2021-etf-visualization.bib",
      "title"     : "Interactive Simulation and Visualization of Long-Term, ETF-based Investment Strategies",
      "date"      : "2021-09-06",
      "authors"   : [ "Martin Büßemeyer", "Daniel Limberger", "Willy Scheibel", "Jürgen Döllner" ],
      "published" : "14th International Symposium on Visual Information Communication and Interaction (VINCI '21)",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "Personal, long-term investment products, especially ones for retirement savings, require thorough understanding to use them profitably. Even simple savings plans based on exchange-traded funds(ETFs) are subject to many variables and uncertainties to be considered for expected and planned-upon returns. We present aninteractive simulation of an ETF-based savings plan that combinesforecasts, risk awareness, taxes and costs, inflation, and dynamicinflows and outflows into a single visualization. The visualizationconsists of four parts: a form-fill interface for configuration, a savings and payout simulation, a cash flow chart, and a savings chart. Based on a specific use case, we discuss how private investors canbenefit from using our visualization after a short training period.",
        "de" : "" },

      "thumbnail" : "publications/2021-vinci-etf-visualization.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3481549.3481568",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/354332166/inline/jsViewer/61486d4e519a1a381f702692&pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://etf-vis.net/?apiKey=ew5r345z43",
          "desc"  : "Demo"
        }],
      "doi": "10.1145/3481549.3481568"
    },
    
    
    { "key"       : "2021-softwaregalaxy",
      "bibtex"    : "asld2021-softwaregalaxy.bib",
      "title"     : "Software Galaxies: Displaying Coding Activities using a Galaxy Metaphor",
      "date"      : "2021-09-07",
      "authors"   : [ "Daniel Atzberger", "Willy Scheibel", "Daniel Limberger", "Jürgen Döllner" ],
      "published" : "14th International Symposium on Visual Information Communication and Interaction (VINCI '21)",
      "articletype" : "Extended Abstract",
      
      "caption"   : {
        "en" : "Software visualization uses metaphors to depict software and software development data that usually has no gestalt. The choice of a metaphor and visual depiction is researched broadly, but deriving a layout based on similarity is still challenging. We present a novel approach to 3D software visualization called Software Galaxy. Our layout is based on applying Latent Dirichlet Allocation on source code. We utilize a metaphor inspired from astronomy for depicting software metrics for single files and clusters. Our first experiments indicate that a 3D visualization capturing semantic relatedness can be beneficial for standard program comprehension tasks.",
        "de" : "" },

      "thumbnail" : "publications/2021-vinci-softwaregalaxy.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3481549.3481573",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/354332172/inline/jsViewer/61486d33519a1a381f70268d&pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/365824584/inline/jsViewer/63f5c8dc0d98a97717ab6258?pdfJsDownload=1",
          "desc"  : "Slides"
        } ],
      "doi": "10.1145/3481549.3481573"
    },
    
    
    { "key"       : "2022-knowhowmap",
      "bibtex"    : "acjsltd2022-knowhowmap.bib",
      "title"     : "Visualization of Knowledge Distribution across Development Teams using 2.5D Semantic Software Maps",
      "date"      : "2022-02-06",
      "authors"   : [ "Daniel Atzberger", "Tim Cech", "Adrian Jobst", "Willy Scheibel", "Daniel Limberger", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "13th International Conference on Information Visualization Theory and Applications (IVAPP '22)",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "In order to detect software risks at an early stage, various software visualization techniques have been developed for monitoring the structure, behaviour, or the underlying development process of software. One of greatest risks for any IT organization consists in an inappropriate distribution of knowledge among its developers, as a projects’ success mainly depends on assigning tasks to developers with the required skills and expertise. In this work, we address this problem by proposing a novel Visual Analytics framework for mining and visualizing the expertise of developers based on their source code activities. Under the assumption that a developer’s knowledge about code is represented directly through comments and the choice of identifier names, we generate a 2D layout using Latent Dirichlet Allocation together with Multidimensional Scaling on the commit history, thus displaying the semantic relatedness between developers. In order to capture a developer’s expertise in a concept, we utilize Labeled LDA trained on a corpus of Open Source projects. By mapping aspects related to skills onto the visual variables of 3D glyphs, we generate a 2.5D Visualization, we call KnowhowMap. We exemplify this approach with an interactive prototype that enables users to analyze the distribution of skills and expertise in an explorative way.",
        "de" : "" },

      "thumbnail" : "publications/2022-ivapp-knowhowmap.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0010991100003124",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Matthias-Trapp-2/publication/358523984/inline/jsViewer/62061c62afa8884cabd8675c?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Matthias-Trapp-2/publication/361585105/inline/jsViewer/62badc31056dae24e8e97d65?pdfJsDownload=1",
          "desc"  : "Slides"
        } ],
      "doi": "10.5220/0010991100003124"
    },
    
    
    { "key"       : "2022-authortopicmodel",
      "bibtex"    : "assltd2022-authortopicmodel.bib",
      "title"     : "Mining Developer Expertise from Bug Tracking Systems using the Author-Topic Model",
      "date"      : "2022-04-25",
      "authors"   : [ "Daniel Atzberger", "Jonathan Schneider", "Willy Scheibel", "Daniel Limberger", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "17th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE '22)",
      "note"      : "Best Student Paper Award",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "During software development processes, software defects, so-called bugs, are captured in a semi-structured manner in bug tracking systems using textual components and categorical features. It is the task of the triage owner to assign open bugs to developers with the required skills and expertise. This task, known as bug triaging, requires an in-depth knowledge about a developer’s skills. Various machine learning techniques have been proposed to automate this task, most of these approaches apply topic models, especially Latent Dirichlet Allocation (LDA), for mining the textual components of bug reports. However none of the proposed approaches explicitly models a developers expertise. In most cases these algorithms are treated as black box, as they allow no explanation about their recommendation. In this work, we show how the Author-Topic Model (ATM), a variant of LDA, can be used to capture a developer’s expertise in the latent topics of a corpus of bug reports from the model itself. Furthermore, we present three novel bug triaging techniques based on the ATM. We compare our approach against a baesline model, that is based on LDA, on a dataset of 18269 bug reports from the Mozilla Firefox project collected between July 1999 to June 2016. The results show that the ATM can outperform the LDA-based approach in terms of the Mean Reciprocal Rank (MRR).",
        "de" : "" },

      "thumbnail" : "publications/2022-enase-authortopicmodel.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0011045100003176",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/360230384/inline/jsViewer/626ba74705d79a3968aa8968?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/365824562/inline/jsViewer/63f5c98f574950594534bad7?pdfJsDownload=1",
          "desc"  : "Slides"
        } ],
      "doi": "10.5220/0011045100003176"
    },
    
    
    { "key"       : "2022-downstreamdependencies",
      "bibtex"    : "tsld2022-downstreamdependencies.bib",
      "title"     : "Augmenting Library Development by Mining Usage Data from Downstream Dependencies",
      "date"      : "2022-04-25",
      "authors"   : [ "Christoph Thiede", "Willy Scheibel", "Daniel Limberger", "Jürgen Döllner" ],
      "published" : "17th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE '22)",
      "note"      : "Candidate for Best Student Paper",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "In the dependency graph of a software ecosystem, downstream dependencies are the nodes that depend on a package. Apart from end-user APIs, these dependencies make up the bulk of a library’s usage for most packages. Other than for upstream dependencies, tools that provide individual package developers with this kind of information rarely exist to date. This paper makes two contributions: (i) We propose an approach for gathering downstream dependencies of a single package efficiently and extracting usage samples from them using a static type analyzer. (ii) We present a tool that allows npm package developers to survey the aggregated usage data directly in their IDE in an interactive and context-sensitive way and that further supports them in understanding which packages use specific package members and why and how they use these members. This can help prioritize and steer development and uncover unexpected usage patterns, inappropriate member signatures, or misleading interface design. Our methods return over 8 000 dependencies for popular packages and process about 12 dependencies per minute while requiring about 500 MB memory in total and less than 30 MB storage per package, but tend to exclude unpopular dependencies. Usage sample extraction is very precise but not easily available for repositories with complex build configurations or metaprogramming patterns. We show that usage data from downstream dependency repositories is a promising and diverse source of information for mining software repositories and that our approach supports package developers in maintaining their APIs.",
        "de" : "" },

      "thumbnail" : "publications/2022-enase-downstream-mining.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0011093700003176",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/360231022/inline/jsViewer/626ba510bfd24037e9dd1eee?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href": "https://github.com/LinqLover/downstream-repository-mining",
          "desc": "Github Project"
        },
        { "href": "https://doi.org/10.5281/zenodo.6338060",
          "desc": "Source Code Archive"
        }
      ],
      "doi": "10.5220/0011093700003176"
    },
    
    
    { "key"       : "2022-gitmining",
      "bibtex"    : "hsd2022-gitmining.bib",
      "title"     : "Tooling for Time- and Space-efficient git Repository Mining",
      "date"      : "2022-05-23",
      "authors"   : [ "Fabian Heseding", "Willy Scheibel", "Jürgen Döllner" ],
      "published" : "19th International Conference on Mining Software Repositories – Data and Tool Showcase Track (MSR '22)",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "Software projects under version control grow with each commit, accumulating up to hundreds of thousands of commits per repository. Especially for such large projects, the traversal of a repository and data extraction for static source code analysis poses a trade-off between granularity and speed. We showcase the command-line tool pyrepositoryminer that combines a set of optimization approaches for efficient traversal and data extraction from git repositories while being adaptable to third-party and custom software metrics and data extractions. The tool is written in Python and combines bare repository access, in-memory storage, parallelization, caching, change-based analysis, and optimized communication between the traversal and custom data extraction components. The tool allows for both metrics written in Python and external programs for data extraction. A single-thread performance evaluation based on a basic mining use case shows a mean speedup of 15.6×to other freely available tools across four mid-sized open source projects. A multi-threaded execution allows for load distribution among cores and, thus, a mean speedup up to 86.9×using 12 threads.",
        "de" : "" },

      "thumbnail" : "publications/2022-msr-git-mining.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3524842.3528503",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/360243146/inline/jsViewer/626bab128e7e1e5d5fa39457?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href": "https://github.com/fabianhe/pyrepositoryminer",
          "desc": "Github Project"
        },
        { "href": "https://doi.org/10.5281/zenodo.5918480",
          "desc": "Source Code Archive"
        }
      ],
      "doi": "10.1145/3524842.3528503"
    },
    
    
    { "key"       : "2022-prometheus",
      "bibtex"    : "jacstd2022-prometheus.bib",
      "title"     : "Efficient GitHub Crawling using the GraphQL API",
      "date"      : "2022-07-04",
      "authors"   : [ "Adrian Jobst", "Daniel Atzberger", "Tim Cech", "Willy Scheibel", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "22th International Conference on Computational Science and Its Applications (ICCSA '22)",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "The number of publicly accessible software repositories on online platforms is growing rapidly. With more than 128 million public repositories (as of March 2020), GitHub is the world’s largest platform for hosting and managing software projects. Where it used to be necessary to merge various data sources, it is now possible to access a wealth of data using the GitHub API alone. However, collecting and analyzing this data is not an easy endeavor. In this paper, we present Prometheus, a system for crawling and storing software repositories from GitHub. Compared to existing frameworks, Prometheus follows an event-driven microservice architecture. By separating functionality on the service level, there is no need to understand implementation details or use existing frameworks to extend or customize the system, only data. Prometheus consists of two components, one for fetching GitHub data and one for data storage which serves as a basis for future functionality. Unlike most existing crawling approaches, the Prometheus fetching service uses the GitHub GraphQL API. As a result, Prometheus can significantly outperform alternatives in terms of throughput in some scenarios.",
        "de" : "" },

      "thumbnail" : "publications/2022-iccsa-prometheus.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1007/978-3-031-10548-7_48",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/361810170/inline/jsViewer/63f5c6200cf1030a5641799f?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/365824474/inline/jsViewer/63f5c66bb1704f343f72aad0?pdfJsDownload=1",
          "desc"  : "Slides"
        } ],
      "doi": "10.1007/978-3-031-10548-7_48"
    },
    
    
    { "key"       : "2022-topicmodel-benchmark",
      "bibtex"    : "acsldt2022-topicmap-benchmark.bib",
      "title"     : "A Benchmark for the Use of Topic Models for Text Visualization Tasks",
      "date"      : "2022-08-16",
      "authors"   : [ "Daniel Atzberger", "Tim Cech", "Willy Scheibel", "Daniel Limberger", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "15th International Symposium on Visual Information Communication and Interaction (VINCI '22)",
      "articletype" : "Extended Abstract",
      
      "caption"   : {
        "en" : "",
        "de" : "" },

      "thumbnail" : "publications/2022-vinci-topicmodel-benchmark.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3554944.3554961",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Matthias-Trapp-2/publication/363174697/inline/jsViewer/63452011ff870c55ce17f64d?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/365824462/inline/jsViewer/63f5c6ba0cf1030a56417ef5?pdfJsDownload=1",
          "desc"  : "Slides"
        } ],
      "doi": "10.1145/3554944.3554961"
    },
    
    
    { "key"       : "2022-configurationsoftwaremaps",
      "bibtex"    : "lsdt2022-configurationsoftwaremaps.bib",
      "title"     : "Visual Variables and Configuration of Software Maps",
      "date"      : "2022-09-16",
      "authors"   : [ "Daniel Limberger", "Willy Scheibel", "Jürgen Döllner", "Matthias Trapp" ],
      "published" : "Journal of Visualization",
      "articletype" : "Article",
      
      "caption"   : {
        "en" : "Software maps provide a general-purpose interactive user interface and information display in software analytics. This paper classifies software maps as a containment-based treemap embedded into a 3D attribute space and introduces respective terminology. It provides a comprehensive overview of advanced visual metaphors and techniques, each suitable for interactive visual analytics tasks. The metaphors and techniques are briefly described, located within a visualization pipeline model, and considered within a software map design space. The general expressiveness and applicability of visual variables are detailed and discussed. Consequent applications and use cases w.r.t. different types of software system data and software engineering data are discussed, arguing for versatile use of software maps in visual software analytics.",
        "de" : "" },

      "thumbnail" : "publications/2022-jov-configurationsoftwaremaps.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1007/s12650-022-00868-1",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/363174603/inline/jsViewer/63242c14873eca0c008f32bf?pdfJsDownload=1",
          "desc"  : "Author Version"
        } ],
      "doi": "10.1007/s12650-022-00868-1"
    },
    
    
    { "key"       : "2022-codecv",
      "bibtex"    : "ascstd2022-codecv.bib",
      "title"     : "CodeCV: Mining Expertise of GitHub Users from Coding Activities",
      "date"      : "2022-10-03",
      "authors"   : [ "Daniel Atzberger", "Nico Scordialo", "Tim Cech", "Willy Scheibel", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "22nd International Working Conference on Source Code Analysis and Manipulation (SCAM '22)",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "The number of software projects developed collaboratively on social coding platforms is steadily increasing. One of the motivations for developers to participate in open-source software development is to make their development activities easier accessible to potential employers, e.g., in the form of a resume for their interests and skills. However, manual review of source code activities is time-consuming and requires detailed knowledge of the technologies used. Existing approaches are limited to a small subset of actual source code activity and metadata and do not provide explanations for their results. In this work, we present CodeCV, an approach to analyzing the commit activities of a GitHub user concerning the use of programming languages, software libraries, and higher-level concepts, e.g., Machine Learning or Cryptocurrency. Skills in using software libraries and programming languages are analyzed based on syntactic structures in the source code. Based on Labeled Latent Dirichlet Allocation, an automatically generated corpus of GitHub projects is used to learn the concept-specific vocabulary in identifier names and comments. This enables the capture of expertise on abstract concepts from a user's commit history. CodeCV further explains the results through links to the relevant commits in an interactive web dashboard. We tested our system on selected GitHub users who mainly contribute to popular projects to demonstrate that our approach is able to capture developers' expertise effectively.",
        "de" : "" },

      "thumbnail" : "publications/2022-scam-codecv.png",
      "downloads" : [{ "href"  : "https://doi.org/10.1109/SCAM55253.2022.00021",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/363174745/inline/jsViewer/63f5d41e0d98a97717aba29d?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/365824568/inline/jsViewer/63f5c7100d98a97717ab52bf?pdfJsDownload=1",
          "desc"  : "Slides"
        } ],
      "doi": "10.1109/SCAM55253.2022.00021"
    },
    
    
    { "key"       : "2022-procedural-texture-patterns",
      "bibtex"    : "lsdd2022-procedural-texture-patterns.bib",
      "title"     : "Procedural Texture Patterns for Encoding Changes in Color in 2.5D Treemap Visualizations",
      "date"      : "2022-10-03",
      "authors"   : [ "Daniel Limberger", "Willy Scheibel", "Jan van Diecken", "Jürgen Döllner" ],
      "published" : "Journal of Visualization",
      "articletype" : "Article",
      
      "caption"   : {
        "en" : "Treemaps depict tree-structured data while maintaining flexibility in mapping data to different visual variables. This work explores how changes in data mapped to color can be represented with rectangular 2.5D treemaps using procedural texture patterns. The patterns are designed to function for both static images and interactive visualizations with animated transitions. During rendering, the procedural texture patterns are superimposed onto the existing color mapping. We present a pattern catalog with seven exemplary patterns having different characteristics in representing the mapped data. This pattern catalog is implemented in a WebGL-based treemap rendering prototype and is evaluated using performance measurements and case studies on two software projects. As a result, this work extends the toolset of visual encodings for 2.5D treemaps by procedural texture patterns to represent changes in color. It serves as a starting point for user-centered evaluation.",
        "de" : "" },

      "thumbnail" : "publications/2022-jov-procedural-texture-patterns.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1007/s12650-022-00874-3",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/publication/363174833/inline/jsViewer/633c3e00ff870c55cefe2861?pdfJsDownload=1",
          "desc"  : "Author Version"
        } ],
      "doi": "10.1007/s12650-022-00874-3"
    },
    
    
    { "key"       : "2022-scatterplot-projections",
      "bibtex"    : "wsld2022-scatterplot-projections.bib",
      "title"     : "Hardware-accelerated Rendering of Web-based 3D Scatter Plots with Projected Density Fields and Embedded Controls",
      "date"      : "2022-11-02",
      "authors"   : [ "Lukas Wagner", "Daniel Limberger", "Willy Scheibel", "Jürgen Döllner" ],
      "published" : "27th International Conference on 3D Web Technology (Web3D '22)",
      "note"      : "Best Paper Award",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "3D scatter plots depicting massive data suffer from occlusion, which makes it difficult to get an overview and perceive structure.  This paper presents a technique that facilitates the comprehension of heavily occluded 3D scatter plots. Data points are projected to axial planes, creating x-ray-like 2D views that support the user in analyzing the data's density and layout. We showcase our open-source web application with a hardware-accelerated rendering component written in WebGL. It allows for interactive interaction, filtering, and navigation with datasets up to hundreds of thousands of nodes. The implementation is detailed and discussed with respect to challenges posed by API and performance limitations.",
        "de" : "" },

      "thumbnail" : "publications/2022-web3d-scatterplot-projections.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1145/3564533.3564566",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/364806579/inline/jsViewer/636d0b912f4bca7fd04bb4a0?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Lukas-Wagner-17/publication/365319445/inline/jsViewer/636ed5e937878b3e87a30f62?pdfJsDownload=1",
          "desc"  : "Slides"
        },
        { "href"  : "https://demo.varg.dev/vidi/web3d-2022",
          "desc"  : "Demo"
        },
        { "href"  : "https://github.com/lukaswagner/vidi",
          "desc"  : "Github Project"
        } ],
      "doi": "10.1145/3564533.3564566"
    },
    
    
    { "key"       : "2023-semantic-software-maps",
      "bibtex"    : "acsld2023-semantic-software-maps.bib",
      "title"     : "Visualization of Source Code Similarity using 2.5D Semantic Software Maps",
      "date"      : "2023-02-02",
      "authors"   : [ "Daniel Atzberger", "Tim Cech", "Willy Scheibel", "Daniel Limberger", "Jürgen Döllner" ],
      "published" : "VISIGRAPP 2021: Computer Vision, Imaging and Computer Graphics Theory and Applications",
      "articletype" : "Chapter",
      
      "caption"   : {
        "en" : "For various program comprehension tasks, software visualization techniques can be beneficial by displaying aspects related to the behavior, structure, or evolution of software. In many cases, the question is related to the semantics of the source code files, e.g., the localization of files that implement specific features or the detection of files with similar semantics. This work presents a general software visualization technique for source code documents, which uses 3D glyphs placed on a two-dimensional reference plane. The relative positions of the glyphs captures their semantic relatedness. Our layout originates from applying Latent Dirichlet Allocation and Multidimensional Scaling on the comments and identifier names found in the source code files. Though different variants for 3D glyphs can be applied, we focus on cylinders, trees, and avatars. We discuss various mappings of data associated with source code documents to the visual variables of 3D glyphs for selected use cases and provide details on our visualization system.",
        "de" : "" },

      "thumbnail" : "publications/2023-ivapp-software-forest-extended.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1007/978-3-031-25477-2_8",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/363175014/inline/jsViewer/63f5c7c4574950594534ab35?pdfJsDownload=1",
          "desc"  : "Author Version"
        }
      ],
      "doi": "10.1007/978-3-031-25477-2_8"
    },
    
    
    { "key"       : "2023-probabilistic-models",
      "bibtex"    : "assdt2023-probabilistic-models.bib",
      "title"     : "Evaluating Probabilistic Topic Models for Bug Triaging Tasks",
      "date"      : "2023-03-01",
      "authors"   : [ "Daniel Atzberger", "Jonathan Schneider", "Willy Scheibel", "Matthias Trapp", "Jürgen Döllner" ],
      "published" : "ENASE 2022: Evaluation of Novel Approaches to Software Engineering",
      "articletype" : "Chapter",
      
      "caption"   : {
        "en" : "During the software development process, occurring problems are collected and managed as bug reports using bug tracking systems. Usually, a bug report is specified by a title, a more detailed description, and additional categorical information, e.g., the affected component or the reporter. It is the task of the triage owner to assign open bug reports to developers with the required skills to fix them. However, the bug assignment task is time-consuming, especially in large software projects with many involved developers. This observation motivates using (semi-)automatic algorithms for assigning bugs to developers. Various approaches have been developed that rely on a machine learning model trained on historical bug reports. Thereby, the modeling of the textual components is mainly done using topic models, mainly Latent Dirichlet Allocation (LDA). Although different variants, inference techniques, and libraries for LDA exist and various hyperparameters can be specified, most works treat topic models as a black box without exploring them in detail. In this work, we extend a study of Atzberger and Schneider et al. on the use of the Author-Topic Model (ATM) for bug triaging tasks. We demonstrate the influence of the underlying topic model, the used library and inference techniques, and the hyperparameters on the bug triaging results. The results of our conducted experiments on a dataset from the Mozilla Firefox project provide guidelines for applying LDA for bug triaging tasks effectively.",
        "de" : "" },

      "thumbnail" : "publications/2023-enase-probabilistic-models-extended.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1007/978-3-031-36597-3_3",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/367351366/inline/jsViewer/64aeb3b4c41fb852dd6c5249?pdfJsDownload=1",
          "desc"  : "Author Version"
        } ],
      "doi": "10.1007/978-3-031-36597-3_3"
    },
    
    
    { "key"       : "2023-evaluating-ssnp",
      "bibtex"    : "casrd2023-evaluating-ssnp.bib",
      "date"      : "2023-02-19",
      "title"     : "Evaluating Architectures and Hyperparameters of Self-supervised Network Projections",
      "authors"   : [ "Tim Cech", "Daniel Atzberger", "Willy Scheibel", "Rico Richter", "Jürgen Döllner" ],
      "published" : "14th International Conference on Information Visualization Theory and Applications (IVAPP '23)",
      "doi"       : "10.5220/0011699700003417",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "Self-Supervised Network Projections (SSNP) are dimensionality reduction algorithms that produce low-dimensional layouts from high-dimensional data. By combining an autoencoder architecture with neighborhood information from a clustering algorithm, SSNP intend to learn an embedding that generates visually separated clusters. In this work, we extend an approach that uses cluster information as pseudo-labels for SSNP by taking outlier information into account. Furthermore, we investigate the influence of different autoencoders on the quality of the generated two-dimensional layouts. We report on two experiments on the autoencoder's architecture and hyperparameters, respectively, measuring nine metrics on eight labeled datasets from different domains, e.g., Natural Language Processing. The results indicate that the model's architecture and the choice of hyperparameter values can influence the layout with statistical significance, but none achieves the best result over all metrics. In addition, we found out that using outlier information for the pseudo-labeling approach can maintain global properties of the two-dimensional layout while trading-off local properties.",
        "de" : "" },

      "thumbnail" : "publications/2023-ivapp-evaluating-ssnp.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0011699700003417",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/367351449/inline/jsViewer/63f7946257495059453920bf?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/368567010/inline/jsViewer/63ee4afc2958d64a5cd5e389?pdfJsDownload=1",
          "desc"  : "Slides"
        },
        { "href"  : "https://github.com/Oluwoye/DimensionReduction",
          "desc"  : "Github Project"
        } ]
    },
    
    
    { "key"       : "2023-defect-prediction",
      "bibtex"    : "casmd2023-defect-prediction.bib",
      "date"      : "2023-05-23",
      "title"     : "Outlier Mining Techniques for Software Defect Prediction",
      "authors"   : [ "Tim Cech", "Daniel Atzberger", "Willy Scheibel", "Sanjay Misra", "Jürgen Döllner" ],
      "published" : "15th International Conference on Software Quality (SWQD '23)",
      "doi"       : "10.1007/978-3-031-31488-9_3",
      "articletype" : "Full Paper",
      
      "caption"   : {
        "en" : "Software metrics measure aspects related to the quality of software. Using software metrics as a method of quantification of software, various approaches were proposed for locating defect-prone source code units within software projects. Most of these approaches rely on supervised learning algorithms, which require labeled data for adjusting their parameters during the learning phase. Usually, such labeled training data is not available. Unsupervised algorithms do not require training data and can therefore help to overcome this limitation. In this work, we evaluate the effect of unsupervised learning - especially outlier mining algorithms - for the task of defect prediction, i.e., locating defect-prone source code units. We investigate the effect of various class balancing and feature compressing techniques as preprocessing steps and show how sliding windows can be used to capture time series of source code metrics. We evaluate the Isolation Forest and Local Outlier Factor, as representants of outlier mining techniques. Our experiments on three publicly available datasets, containing a total of 11 software projects, indicate that the consideration of time series can improve static examinations by up to 3%. The results further show that supervised algorithms can outperform unsupervised approaches on all projects. Among all unsupervised approaches, the Isolation Forest achieves the best accuracy on 10 out of 11 projects.",
        "de" : "" },

      "thumbnail" : "publications/2023-swqd-defect-prediction.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1007/978-3-031-31488-9_3",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/370746953/inline/jsViewer/64aeb537c41fb852dd6c5365?pdfJsDownload=1",
          "desc"  : "Author Version"
        } ]
    },
    
    
    { "key"       : "2023-log-outlier",
      "bibtex"    : "acsd2023-log-outlier.bib",
      "date"      : "2023-04-24",
      "title"     : "Detecting Outliers in CI/CD Pipeline Logs using Latent Dirichlet Allocation",
      "authors"   : [ "Daniel Atzberger", "Tim Cech", "Willy Scheibel", "Rico Richter", "Jürgen Döllner" ],
      "published" : "18th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE '23)",
      "doi"       : "10.5220/0011858500003464",
      "articletype" : "Short Paper",
      
      "caption"   : {
        "en" : "Continuous Integration and Continuous Delivery are best practices used during the DevOps phase. By using automated pipelines for building and testing small software changes, possible risks are intended to be detected early. Those pipelines continuously generate log events that are collected in semi-structured log files. In an industry context, these log files can amass 100,000 events and more. However, the relevant sections in these log files must be manually tagged by the user. This paper presents an online-learning approach for detecting relevant log events using Latent Dirichlet Allocation. After grouping a fixed number of log events in a document, our approach prunes the vocabulary to eliminate words without semantic meaning. A sequence of documents is then described as a discrete sequence by applying Latent Dirichlet Allocation, which allows the detection of outliers within the sequence. Our approach provides an explanation of the results by integrating the latent variables of the model. The approach is tested on log files that originate from a CI/CD pipeline of a large German company. Our results indicate that whether or not a log event is marked as an outlier heavily depends on the chosen hyperparameters of our model.",
        "de" : "" },

      "thumbnail" : "publications/2023-enase-log-outlier.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.5220/0011858500003464",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/368566654/inline/jsViewer/6446ab29d749e4340e34c51d?pdfJsDownload=1",
          "desc"  : "Author Version"
        } ]
    },
    
    
    { "key"       : "2023-realestatetokenization",
      "bibtex"    : "hasd2023-realestatetokenization.bib",
      "date"      : "2023-05-01",
      "title"     : "Real Estate Tokenization in Germany: Market Analysis and Concept of a Regulatory and Technical Solution",
      "authors"   : [ "Robert Henker", "Daniel Atzberger", "Willy Scheibel", "Jürgen Döllner" ],
      "published" : "5th International Conference on Blockchain and Cryptocurrency (ICBC '23)",
      "articletype" : "Short Paper",
      "doi"       : "10.1109/ICBC56567.2023.10174954",
      
      "caption"   : {
        "en" : "Real estate is the largest asset class and is equally popular with professional and retail investors. However, this asset class has the disadvantage that it is very illiquid, and investments have a high entry barrier in terms of equity. The adoption of the Electronic Securities Act in 2021 by the German Bundestag has created the legal framework for tokenizing real estate assets and their management using digital ledger technology in Germany. In this paper we describe a business concept for managing ownership and business transactions for real estate in Germany using blockchain technology. Besides its possibilities, we present a market analysis that comprises existing approaches and discusses legal limitations specific to Germany.",
        "de" : "" },

      "thumbnail" : "publications/2023-icbc-realestatetokenization.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1109/ICBC56567.2023.10174954",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/369588396/inline/jsViewer/6450f90197449a0e1a7038fa?pdfJsDownload=1",
          "desc"  : "Author Version"
        } ]
    },
    
    
    { "key"       : "2023-hephaistos",
      "bibtex"    : "havsdb2023-hephaistos.bib",
      "date"      : "2023-05-01",
      "title"     : "Hephaistos: A Management System for Massive Order Book Data from Multiple Centralized Crypto Exchanges with an Internal Unified Order Book",
      "authors"   : [ "Robert Henker", "Daniel Atzberger", "Jan Ole Vollmer", "Willy Scheibel", "Jürgen Döllner", "Markus Bick" ],
      "published" : "1st International Workshop on Cryptocurrency Exchanges (CryptoEx '23)",
      "articletype" : "Full Paper",
      "doi"       : "10.1109/ICBC56567.2023.10174923",
      
      "caption"   : {
        "en" : "Offers to buy and sell cryptocurrencies on exchanges are collected in an order book as pairs of amount and price provided with a timestamp. Contrary to tick data, which only reflects the last transaction price on an exchange, the order book reflects the market’s actual price information and the available volume. Until now, no system has been presented that can capture many different order books across several markets. This paper presents Hephaistos, a system for processing, harmonizing, and storing massive spot order book data from 22 centralized crypto exchanges and 55 currency pairs. After collecting the data, Hephaistos aggregates several order books in a so-called Unified Order Book, which is the foundation for a Smart Order Routing algorithm. As a result an order is splitted across several exchanges, which results in a better execution price. As component of a high-frequency trading system, Hephaistos captures 32 % of the total daily spot trading volume. We provide examples with data from two exchanges that show that the Smart Order Routing algorithm significantly reduces the slippage.",
        "de" : "" },

      "thumbnail" : "publications/2023-cryptoex-hephaistos.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1109/ICBC56567.2023.10174923",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/369588402/inline/jsViewer/645504735762c95ac37645b2?pdfJsDownload=1",
          "desc"  : "Author Version"
        } ]
    },
    
    
    { "key"       : "2023-orderbookvis",
      "bibtex"    : "jahsd2023-orderbookvis.bib",
      "date"      : "2023-05-01",
      "title"     : "OrderBookVis: A Visualization Approach for Comparing Order Books from Centralized Crypto Exchanges",
      "authors"   : [ "Adrian Jobst", "Daniel Atzberger", "Robert Henker", "Willy Scheibel", "Jürgen Döllner" ],
      "published" : "1st International Workshop on Cryptocurrency Exchanges (CryptoEx '23)",
      "articletype" : "Short Paper",
      "doi"       : "10.1109/ICBC56567.2023.10174944",
      
      "caption"   : {
        "en" : "Trading for a currency pair on centralized crypto exchanges is organized via an order book, which collects all open buy and sell orders at any given time and thus forms the basis for price formation. Usually, the exchanges provide basic visualizations, which show the accumulated buy and sell volume in an animated 2D representation. However, this visualization does not allow the user to compare different order books, e.g., several order book snapshots. In this work, we present OrderBookVis, a 2.5D representation that shows a discrete set of order books comparatively. For this purpose, the individual snapshots are displayed as a 2D representation as usual and placed one after the other on a 2D reference plane. As possible use cases, we discuss the analysis of the temporal evolution of the order book for a fixed market and the comparison of different order books across multiple markets.",
        "de" : "" },

      "thumbnail" : "publications/2023-cryptoex-orderbookvis.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1109/ICBC56567.2023.10174944",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/369588558/inline/jsViewer/645504b297449a0e1a7da052?pdfJsDownload=1",
          "desc"  : "Author Version"
        } ]
    },
    
    
    { "key"       : "2023-liquidityanalysis",
      "bibtex"    : "jahvsd2023-liquidityanalysis.bib",
      "date"      : "2023-05-01",
      "title"     : "Examining Liquidity of Exchanges and Assets and the Impact of External Events in Centralized Crypto Markets: A 2022 Study",
      "authors"   : [ "Adrian Jobst", "Daniel Atzberger", "Robert Henker", "Jan Ole Vollmer", "Willy Scheibel", "Jürgen Döllner" ],
      "published" : "1st International Workshop on Cryptocurrency Exchanges (CryptoEx '23)",
      "articletype" : "Full Paper",
      "doi"       : "10.1109/ICBC56567.2023.10174905",
      
      "caption"   : {
        "en" : "Most cryptocurrencies are bought and sold on centralized exchanges that manage supply and demand via an order book. Besides trading fees, the high liquidity of a market is the most relevant reason for choosing one exchange over the other. However, as the different liquidity measures rely on the order book, external events that cause people to sell or buy a cryptocurrency can significantly impact a market's liquidity. To investigate the effect of external events on liquidity, we measure various liquidity measures for nine different order books comprising three currency pairs across three exchanges covering the entire year 2022. The resulting multivariate time series is then analyzed using different correlations. From the results, we can infer that as a cryptocurrency's market capitalization and the exchange's trading volume increases, so does its liquidity. At the same time, only a moderate correlation of liquidity between exchanges can be observed. Furthermore, our statistical observations show that external events, particularly the events around FTX and the Terra Luna crash, caused significant changes in liquidity. However, depending on the exchange's size and the cryptocurrency's market cap, the liquidity took a shorter or longer time to recover.",
        "de" : "" },

      "thumbnail" : "publications/2023-cryptoex-liquidityanalysis.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.1109/ICBC56567.2023.10174905",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/369588456/inline/jsViewer/6455049a97449a0e1a7da04c?pdfJsDownload=1",
          "desc"  : "Author Version"
        } ]
    },
    
    
    { "key"       : "2023-attentionvisualization",
      "bibtex"    : "kjfsd2023-attentionvisualization.bib",
      "date"      : "2023-07-03",
      "title"     : "Insights from Attention: New Approaches to Visualizing Transformer Model Output",
      "authors"   : [ "Raphael Kunert", "Adrian Jobst", "Andreas Fricke", "Willy Scheibel", "Jürgen Döllner" ],
      "published" : "23rd International Conference on Computational Science and its Applications (ICCSA '23)",
      "articletype" : "Short Paper",
      "pending": true,
      
      "caption"   : {
        "en" : "Recent advancements in language models, particularly those based on the Transformer architecture, have led to remarkable achievements in natural language processing. However, the increasing complexity and size of these models pose significant challenges for understanding their behavior and decision-making processes. In this work, we propose a set of new attention visualization techniques that address these challenges by improving model explainability and interpretability. The key improvements include new layouts that better handle the large number of tokens present in prompt and answer scenarios, making long distance attention relationships more comprehensible. Our techniques have the potential to enable researchers and practitioners to better understand the decision-making processes of large language models and identify potential sources of bias or errors. While detailed user studies and evaluations are outside the scope of this work, we discuss potential use cases for our visualization techniques and present directions for future research.",
        "de" : "" },

      "thumbnail" : "publications/2023-iccsa-attentionvisualization.png",
      "downloads" : []
    },
    
    
    { "key"       : "2023-githubembedded",
      "bibtex"    : "sblad2023-githubembedded.bib",
      "date"      : "2023-07-03",
      "title"     : "Embedding Visual Software Analytics on the GitHub Platform on the Example of Static Source Code Metrics and Software Maps",
      "authors"   : [ "Willy Scheibel", "Jasper Blum", "Franziska Lauterbach", "Daniel Atzberger", "Jürgen Döllner" ],
      "published" : "23rd International Conference on Computational Science and its Applications (ICCSA '23)",
      "articletype" : "Full Paper",
      "pending": true,
      
      "caption"   : {
        "en" : "Readily available software analytics tools are often operated as external services, where measured software analysis data is kept internal, and no external use of the data is available. We propose an approach for embedded visual software analytics on the GitHub platform by leaveraging GitHub Actions and the GitHub API. The proposed approach collects static source code metrics for each commit and augments the commit by the resulting software analytics data that is stored as git objects within the same repository. We show that this approach is feasible to be integrated into software projects as it poses only little overhead to CI runtime and storage overhead. The stored software analytics data is externally accessible to allow for external visualization tools, such as software maps. This enables a large amount of projects to have access to software analytics as well as provide means to communicate the current status of a project.",
        "de" : "" },

      "thumbnail" : "publications/2023-iccsa-githubembedded.png",
      "downloads" : []
    },
    
    
    { "key"       : "2023-saliencnn",
      "bibtex"    : "cssd2023-saliencnn.bib",
      "date"      : "2023-06-12",
      "title"     : "A Dashboard for Interactive Convolutional Neural Network Training And Validation Through Saliency Maps",
      "authors"   : [ "Tim Cech", "Furkan Simsek", "Willy Scheibel", "Jürgen Döllner" ],
      "published" : "25th EG Conference on Visualization (EuroVis '23)",
      "doi"       : "10.2312/evp20231054",
      "articletype" : "Extended Abstract",
      
      "caption"   : {
        "en" : "",
        "de" : "" },

      "thumbnail" : "publications/2023-eurovis-saliencnn.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.2312/evp20231054",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/370772987/inline/jsViewer/64aeb586b9ed6874a5153869?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/370773056_Cech_-_EuroVis_2023_Poster_-_A_Dashboard_for_Interactive_Convolutional_Neural_Network_Training_And_Validation_Through_Saliency_Maps_-_Supplemental_Materialpdf/data/6462a5b0fbaf5b27a4cb5399/Cech-EuroVis-2023-Poster-A-Dashboard-for-Interactive-Convolutional-Neural-Network-Training-And-Validation-Through-Saliency-Maps-Supplemental-Material.pdf",
          "desc"  : "Supplemental Material"
        },
	      { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/372307685/inline/jsViewer/64aeb850c41fb852dd6c5641?pdfJsDownload=1",
          "desc"  : "Poster"
        } ]
    },
    
    
    { "key"       : "2023-hilbertmoorecontinuous",
      "bibtex"    : "sd2023-hilbertmoorecontinuous.bib",
      "date"      : "2023-06-12",
      "title"     : "Constructing Hierarchical Continuity in Hilbert & Moore Treemaps",
      "authors"   : [ "Willy Scheibel", "Jürgen Döllner" ],
      "published" : "25th EG Conference on Visualization (EuroVis '23)",
      "doi"       : "10.2312/evp20231060",
      "articletype" : "Extended Abstract",
      
      "caption"   : {
        "en" : "",
        "de" : "" },

      "thumbnail" : "publications/2023-eurovis-hilbertmoorecontinuous.png",
      "downloads" : [
        { "href"  : "https://doi.org/10.2312/evp20231060",
          "desc"  : "Publisher Record"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/370769807/inline/jsViewer/646246fe434e26474feb0bcd?pdfJsDownload=1",
          "desc"  : "Author Version"
        },
        { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/370770050_Scheibel_-_EuroVis_2023_-_Constructing_Hierarchical_Continuity_in_Hilbert_Moore_Treemaps_-_Supplemental_Materialpdf/data/6462477e434e26474feb0bdb/Scheibel-EuroVis-2023-Constructing-Hierarchical-Continuity-in-Hilbert-Moore-Treemaps-Supplemental-Material.pdf",
          "desc"  : "Supplemental Material"
        },
	      { "href"  : "https://www.researchgate.net/profile/Willy-Scheibel/publication/370769813/inline/jsViewer/64624808fbaf5b27a4cb4366?pdfJsDownload=1",
          "desc"  : "Poster"
        },
        { "href"  : "https://doi.org/10.5281/zenodo.7934497",
          "desc"  : "Source Code"
        },
        { "href"  : "https://github.com/varg-dev/hilbert-moore-treemap-layouts-prototype",
          "desc"  : "Github Project"
        }
      ]
    },
    
    
    { "key"       : "2023-evaluation-tm-dr",
      "bibtex"    : "acstrds2023-evaluation-tm-dr.bib",
      "date"      : "2023-10-22",
      "title"     : "Large-Scale Evaluation of Topic Models and Dimensionality Reduction Methods for 2D Text Spatialization",
      "authors"   : [ "Daniel Atzberger", "Tim Cech", "Willy Scheibel", "Matthias Trapp", "Rico Richter", "Jürgen Döllner", "Tobias Schreck" ],
      "published" : "28th IEEE Conference on Visualization (VIS '23)",
      "articletype" : "Article",
      "pending"   : true,
      
      "caption"   : {
        "en" : "Topic models are a class of unsupervised learning algorithms for detecting the semantic structure within a text corpus. Together with a subsequent dimensionality reduction algorithm, topic models can be used for deriving spatializations for text corpora as two-dimensional scatter plots, reflecting semantic similarity between the documents and supporting corpus analysis. Although the choice of the topic model, the dimensionality reduction, and their underlying hyperparameters significantly impact the resulting layout, it is unknown which particular combinations result in high-quality layouts with respect to accuracy and perception metrics. To investigate the effectiveness of topic models and dimensionality reduction methods for the spatialization of corpora as two-dimensional scatter plots (or basis for landscape-type visualizations), we present a large-scale, benchmark-based computational evaluation. Our evaluation consists of (1) a set of corpora, (2) a set of layout algorithms that are combinations of topic models and dimensionality reductions, and (3) quality metrics for quantifying the resulting layout. The corpora are given as document-term matrices, and each document is assigned to a thematic class. The chosen metrics quantify the preservation of local and global properties and the perceptual effectiveness of the two-dimensional scatter plots. By evaluating the benchmark on a computing cluster, we derived a multivariate dataset with over 45 000 individual layouts and corresponding quality metrics. Based on the results, we propose guidelines for the effective design of text spatializations that are based on topic models and dimensionality reductions. As a main result, we show that interpretable topic models are beneficial for capturing the structure of text corpora. We furthermore recommend the use of t-SNE as a subsequent dimensionality reduction.",
        "de" : "" },

      "thumbnail" : "publications/2023-vis-evaluation-tm-dr.png",
      "downloads" : []
    }
  ]
}
